In [43]:
# I need merge 2 tables with using personId key
import pandas as pd

data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [44]:
person.head()

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [45]:
address.head()

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [46]:
pd.merge(person, address, on='personId')

   personId firstName lastName  addressId           city     state
0         2     Alice      Bob          1  New York City  New York

In [81]:
def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    merged_tables = (
        ### используя .mertge() соединяем две таблицы 
        ### по ключу on='personId' 
        ### способом how='left'
        pd.merge(
            person,
            address,
            on='personId',
            how='left' ### Если не использовать left, то пустых строчек не будет. (тех строчек, в столбцах которых есть NaN)
        )
    )
    return merged_tables[['firstName', 'lastName', 'city', 'state']] ### Выводим конкретные столбцы которые требует задача.

In [80]:
combine_two_tables(person, address)

  firstName lastName           city     state
0     Alice      Bob  New York City  New York